using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;

namespace Tur
{
    public partial class Country : Form
    {
        public Country()
        {
            InitializeComponent();
        }

        private void pictureBox1_Click(object sender, EventArgs e)
        {

        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            if (comboBox1.Text == "Польша")
            {
                
                pictureBox1.Image = Image.FromFile("pln.jpg");
                richTextBox1.Text = "Польша – страна в Восточной Европе на берегу Балтийского моря, известная своей средневековой архитектурой и еврейскими кварталами. Город Краков славится Королевским замком XIV века на холме Вавель, из которого открывается великолепный вид на средневековый старый город, где расположены Суконные ряды – торговое здание эпохи Возрождения на Главной рыночной площади. Неподалеку от города находится музей Аушвиц-Биркенау, открытый на месте нацистского концлагеря Освенцим, и соляная шахта в Величке, которая представляет собой цепь коридоров и камер.";
            }
            if (comboBox1.Text == "Казахстан")
            {
                
           
                pictureBox1.Image = Image.FromFile("kz.png");
                richTextBox1.Text = "Казахстан – государство в Центральной Азии, которое раньше входило в состав СССР. Оно простирается от Каспийского моря на западе до Алтайских гор на востоке, где проходит граница с Китаем и Россией. Алма-Ата – самый большой город и важный торговый центр страны. Среди достопримечательностей города стоит отметить Вознесенский собор Русской православной церкви, построенный при Николае II, и Центральный государственный музей Республики Казахстан, тысячи экспонатов которого позволяют получить представление об истории государства.";
            }
            if (comboBox1.Text == "Україна" )
            {

                pictureBox1.Image = Image.FromFile("uk.png");
                richTextBox1.Text = "Украина – это большая страна в Восточной Европе, известная православными церквями, черноморскими курортами и лесистыми горами. В Киеве, столице страны, расположен Софийский собор, украшенный золотыми куполами, мозаикой XI века и фресками. Над рекой Днепр возвышается монастырь Киево-Печерская лавра, место паломничества многих православных христиан. В ее скитах хранятся религиозные реликвии, а в катакомбах – мумифицированные останки православных монахов.";
            }
             if (comboBox1.Text == "Молдова")
            {
                

                pictureBox1.Image = Image.FromFile("mld.png");
                richTextBox1.Text = "Молдова – государство в Восточной Европе, которое раньше входило в состав СССР. Территорию Молдовы занимают леса, горы и виноградные плантации. Главные винодельческие регионы страны – Нистреана, известная красными винами, и Кодры, где находятся одни из крупнейших винных погребов в мире. Столица страны, город Кишинёв, славится архитектурой времен СССР. Также здесь есть Национальный музей истории Молдовы. В нем представлены различные произведения искусства и этнографические коллекции, подчеркивающие культурную связь страны с Румынией.";
            }
             if (comboBox1.Text == "Латвія")
            {
                

                pictureBox1.Image = Image.FromFile("LTV.jpg");
                richTextBox1.Text = " Латвия – страна на побережье Балтийского моря между Литвой и Эстонией, которая славится своими широкими пляжами и огромными густыми лесами. Столица страны Рига привлекает туристов благодаря деревянным зданиям, домам в югендстиле (он же модерн), огромному Центральному рынку и средневековому Старому городу с церковью Святого Петра. В Латвийском этнографическом музее под открытым небом можно познакомиться с традиционными ремеслами, музыкой и кухней.";
            }
        }

        private void button1_Click(object sender, EventArgs e)
        {



        Trip.country = comboBox1.Text;

            DateTrip f2 = new DateTrip();
            this.Hide();
            f2.ShowDialog();
           
        }

        private void richTextBox1_TextChanged(object sender, EventArgs e)
        {

        }
    }
}
